//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
//テキスト・ユーティリティ・クラス
//
//作成日：2004/06/22
//作成者：末広
//
//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
//文字列に含まれるHTMLタグを無効化する
//引数
//$str : 文字列
//戻り値
//HTMLタグを無効化した文字列
//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
//入力文字列のサニタイジング
//[引　数] $str: 文字列
//[戻り値] サニタイジングした文字列
//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/

function blockHTML(str) //$block_html = str_replace("<","&lt;",$str);
//$block_html = str_replace("<","&lg;",$block_html);
//return $block_html;
{
	return htmlspecialchars(str);
};

function sanitizeStr(str) //print "IN:" . $str . "<br>";
//文字列をSQLクエリー用にエスケープ
//$str = pg_escape_string($str);
//HTMLタグの除去
//$str = strip_tags($str);
//HTMLタグの無効化
//$str = htmlentities($str,0,'EUCJP');
//$str = htmlspecialchars($str);
//print "OUT:" . $str . "<br>";
{
	return str;
};